{"class_name": "Model", "config": {"name": "model_32", "layers": [{"name": "input_49", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_49"}, "inbound_nodes": []}, {"name": "dense_92", "class_name": "Dense", "config": {"name": "dense_92", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "dense_93", "class_name": "Dense", "config": {"name": "dense_93", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "lambda_63", "class_name": "Lambda", "config": {"name": "lambda_63", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB8AGQAZACFAmQBZgIZAGcBUwApAk7pAAAAAKkAKQHa\nAXNyAgAAAHICAAAA+iA8aXB5dGhvbi1pbnB1dC0xMjAtMDg2MzMxMzAwYjJmPtoIPGxhbWJkYT4E\nAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_92", 0, 0, {}]]]}, {"name": "lambda_65", "class_name": "Lambda", "config": {"name": "lambda_65", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB8AGQAZACFAmQBZgIZAGcBUwApAk7pAAAAAKkAKQHa\nAXNyAgAAAHICAAAA+iA8aXB5dGhvbi1pbnB1dC0xMjAtMDg2MzMxMzAwYjJmPtoIPGxhbWJkYT4M\nAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_93", 0, 0, {}]]]}, {"name": "reshape_40", "class_name": "Reshape", "config": {"name": "reshape_40", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_63", 0, 0, {}]]]}, {"name": "reshape_42", "class_name": "Reshape", "config": {"name": "reshape_42", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_65", 0, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["reshape_40", 0, 0, {}]], [["reshape_42", 0, 0, {}]]]}, {"name": "multiply_25", "class_name": "Multiply", "config": {"name": "multiply_25", "trainable": true}, "inbound_nodes": [[["dense_92", 0, 0, {}], ["model_1", 1, 0, {}]]]}, {"name": "multiply_26", "class_name": "Multiply", "config": {"name": "multiply_26", "trainable": true}, "inbound_nodes": [[["dense_93", 0, 0, {}], ["model_1", 2, 0, {}]]]}, {"name": "lambda_64", "class_name": "Lambda", "config": {"name": "lambda_64", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPogPGlweXRob24taW5wdXQtMTIwLTA4NjMz\nMTMwMGIyZj7aCDxsYW1iZGE+CAAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_25", 0, 0, {}]]]}, {"name": "lambda_66", "class_name": "Lambda", "config": {"name": "lambda_66", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPogPGlweXRob24taW5wdXQtMTIwLTA4NjMz\nMTMwMGIyZj7aCDxsYW1iZGE+EAAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_26", 0, 0, {}]]]}, {"name": "reshape_41", "class_name": "Reshape", "config": {"name": "reshape_41", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_64", 0, 0, {}]]]}, {"name": "reshape_43", "class_name": "Reshape", "config": {"name": "reshape_43", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_66", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": 1}, "inbound_nodes": [[["reshape_41", 0, 0, {}], ["reshape_43", 0, 0, {}]]]}, {"name": "dense_94", "class_name": "Dense", "config": {"name": "dense_94", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "dense_95", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_94", 0, 0, {}]]]}], "input_layers": [["input_49", 0, 0]], "output_layers": [["dense_95", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}