{"class_name": "Model", "config": {"name": "model_16", "layers": [{"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "model_15", "class_name": "Model", "config": {"name": "model_15", "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "units": 2, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB0AGoBZAF8ABgAfABnAoMBUwApAk7pAQAAACkC2gFL\n2gtjb25jYXRlbmF0ZSkB2gFzqQByBQAAAPofPGlweXRob24taW5wdXQtODAtZmM0YzkxYzRlZjJj\nPtoIPGxhbWJkYT4EAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["lambda_18", 0, 0]]}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQAZAGFAmYCGQBTACkCTukCAAAAqQAp\nAdoBc3ICAAAAcgIAAAD6HzxpcHl0aG9uLWlucHV0LTg3LTI1NDJlYWUzNWFlMj7aCDxsYW1iZGE+\nBAAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "multiply_11", "class_name": "Multiply", "config": {"name": "multiply_11", "trainable": true}, "inbound_nodes": [[["model_15", 1, 0, {}], ["lambda_19", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPofPGlweXRob24taW5wdXQtODctMjU0MmVh\nZTM1YWUyPtoIPGxhbWJkYT4HAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_11", 0, 0, {}]]]}], "input_layers": [["input_16", 0, 0]], "output_layers": [["lambda_20", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}