{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "x", "class_name": "Lambda", "config": {"name": "x", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQAZAGFAmYCGQBTACkCTukEAAAAqQAp\nAdoBc3ICAAAAcgIAAAD6HzxpcHl0aG9uLWlucHV0LTMzLTdiNzI1M2JmY2JiMT7aCDxsYW1iZGE+\nAwAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [4], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "y", "class_name": "Lambda", "config": {"name": "y", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQBZACFAmYCGQBTACkCTukEAAAAqQAp\nAdoBc3ICAAAAcgIAAAD6HzxpcHl0aG9uLWlucHV0LTMzLTdiNzI1M2JmY2JiMT7aCDxsYW1iZGE+\nBwAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [4, 1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "reshape_9", "class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "target_shape": [4]}, "inbound_nodes": [[["x", 0, 0, {}]]]}, {"name": "reshape_10", "class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "target_shape": [4]}, "inbound_nodes": [[["y", 0, 0, {}]]]}, {"name": "module", "class_name": "Model", "config": {"name": "module", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "x", "class_name": "Lambda", "config": {"name": "x", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtMjgtZmNmZDAwOTM0MGY2PtoIPGxhbWJkYT4DAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "b1", "class_name": "Lambda", "config": {"name": "b1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QIAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtMjgtZmNmZDAwOTM0MGY2PtoIPGxhbWJkYT4FAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "b2", "class_name": "Lambda", "config": {"name": "b2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QMAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtMjgtZmNmZDAwOTM0MGY2PtoIPGxhbWJkYT4GAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "drop_v", "class_name": "Lambda", "config": {"name": "drop_v", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcyAAAAB0AGoBfABkARkAfABkAhkAfABkAxkAZwNkAmQEjQJT\nACkFTukAAAAA6QEAAADpAgAAACkB2gRheGlzKQLaAUvaBXN0YWNrKQHaAXOpAHIIAAAA+h88aXB5\ndGhvbi1pbnB1dC0yOC1mY2ZkMDA5MzQwZjY+2gg8bGFtYmRhPgcAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [3], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["b1", 0, 0, {}], ["b2", 0, 0, {}], ["x", 0, 0, {}]]]}, {"name": "v", "class_name": "Lambda", "config": {"name": "v", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QEAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtMjgtZmNmZDAwOTM0MGY2PtoIPGxhbWJkYT4EAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "border", "class_name": "Model", "config": {"name": "border", "layers": [{"name": "input_8", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_8"}, "inbound_nodes": []}, {"name": "attention", "class_name": "Model", "config": {"name": "attention", "layers": [{"name": "input_5", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_5"}, "inbound_nodes": []}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB0AGoBZAF8ABgAfABnAoMBUwApAk7pAQAAACkC2gFL\n2gtjb25jYXRlbmF0ZSkB2gFzqQByBQAAAPofPGlweXRob24taW5wdXQtMTktNzVmMDA2YWE0ZjU0\nPtoIPGxhbWJkYT4FAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["model_1", 1, 0, {}]]]}], "input_layers": [["input_5", 0, 0]], "output_layers": [["lambda_5", 0, 0]]}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "b1b2", "class_name": "Lambda", "config": {"name": "b1b2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQAZAGFAmYCGQBTACkCTukCAAAAqQAp\nAdoBc3ICAAAAcgIAAAD6HzxpcHl0aG9uLWlucHV0LTQ3LTQ4MTI0NWI5ZjgyOT7aCDxsYW1iZGE+\nBgAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"name": "multiply_3", "class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true}, "inbound_nodes": [[["attention", 1, 0, {}], ["b1b2", 0, 0, {}]]]}, {"name": "lambda_8", "class_name": "Lambda", "config": {"name": "lambda_8", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPofPGlweXRob24taW5wdXQtNDctNDgxMjQ1\nYjlmODI5PtoIPGxhbWJkYT4JAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["lambda_8", 0, 0]]}, "inbound_nodes": [[["drop_v", 0, 0, {}]]]}, {"name": "xv", "class_name": "Lambda", "config": {"name": "xv", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxoAAAB0AGoBfABkARkAfABkAhkAZwJkAmQDjQJTACkETukA\nAAAA6QEAAAApAdoEYXhpcykC2gFL2gVzdGFjaykB2gFzqQByBwAAAPofPGlweXRob24taW5wdXQt\nMjgtZmNmZDAwOTM0MGY2PtoIPGxhbWJkYT4OAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["x", 0, 0, {}], ["v", 0, 0, {}]]]}, {"name": "reshape_6", "class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["border", 1, 0, {}]]]}, {"name": "xvb", "class_name": "Concatenate", "config": {"name": "xvb", "trainable": true, "axis": -1}, "inbound_nodes": [[["xv", 0, 0, {}], ["reshape_6", 0, 0, {}]]]}, {"name": "new_v", "class_name": "Lambda", "config": {"name": "new_v", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAEAAABDAAAAcwYAAAB8AAsAUwApAU6pACkB2gFzcgEAAAByAQAAAPofPGlw\neXRob24taW5wdXQtMjgtZmNmZDAwOTM0MGY2PtoIPGxhbWJkYT4WAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["v", 0, 0, {}]]]}, {"name": "bounce", "class_name": "Model", "config": {"name": "bounce", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "inbound_nodes": [[["xvb", 0, 0, {}]]]}, {"name": "reshape_7", "class_name": "Reshape", "config": {"name": "reshape_7", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["new_v", 0, 0, {}]]]}, {"name": "attention", "class_name": "Model", "config": {"name": "attention", "layers": [{"name": "input_49", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_49"}, "inbound_nodes": []}, {"name": "dense_92", "class_name": "Dense", "config": {"name": "dense_92", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "dense_93", "class_name": "Dense", "config": {"name": "dense_93", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "lambda_63", "class_name": "Lambda", "config": {"name": "lambda_63", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB8AGQAZACFAmQBZgIZAGcBUwApAk7pAAAAAKkAKQHa\nAXNyAgAAAHICAAAA+iA8aXB5dGhvbi1pbnB1dC0xMjAtMDg2MzMxMzAwYjJmPtoIPGxhbWJkYT4E\nAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_92", 0, 0, {}]]]}, {"name": "lambda_65", "class_name": "Lambda", "config": {"name": "lambda_65", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB8AGQAZACFAmQBZgIZAGcBUwApAk7pAAAAAKkAKQHa\nAXNyAgAAAHICAAAA+iA8aXB5dGhvbi1pbnB1dC0xMjAtMDg2MzMxMzAwYjJmPtoIPGxhbWJkYT4M\nAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_93", 0, 0, {}]]]}, {"name": "reshape_40", "class_name": "Reshape", "config": {"name": "reshape_40", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_63", 0, 0, {}]]]}, {"name": "reshape_42", "class_name": "Reshape", "config": {"name": "reshape_42", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_65", 0, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["reshape_40", 0, 0, {}]], [["reshape_42", 0, 0, {}]]]}, {"name": "multiply_25", "class_name": "Multiply", "config": {"name": "multiply_25", "trainable": true}, "inbound_nodes": [[["dense_92", 0, 0, {}], ["model_1", 1, 0, {}]]]}, {"name": "multiply_26", "class_name": "Multiply", "config": {"name": "multiply_26", "trainable": true}, "inbound_nodes": [[["dense_93", 0, 0, {}], ["model_1", 2, 0, {}]]]}, {"name": "lambda_64", "class_name": "Lambda", "config": {"name": "lambda_64", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPogPGlweXRob24taW5wdXQtMTIwLTA4NjMz\nMTMwMGIyZj7aCDxsYW1iZGE+CAAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_25", 0, 0, {}]]]}, {"name": "lambda_66", "class_name": "Lambda", "config": {"name": "lambda_66", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPogPGlweXRob24taW5wdXQtMTIwLTA4NjMz\nMTMwMGIyZj7aCDxsYW1iZGE+EAAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_26", 0, 0, {}]]]}, {"name": "reshape_41", "class_name": "Reshape", "config": {"name": "reshape_41", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_64", 0, 0, {}]]]}, {"name": "reshape_43", "class_name": "Reshape", "config": {"name": "reshape_43", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_66", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": 1}, "inbound_nodes": [[["reshape_41", 0, 0, {}], ["reshape_43", 0, 0, {}]]]}, {"name": "dense_94", "class_name": "Dense", "config": {"name": "dense_94", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "dense_95", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_94", 0, 0, {}]]]}], "input_layers": [["input_49", 0, 0]], "output_layers": [["dense_95", 0, 0]]}, "inbound_nodes": [[["xvb", 0, 0, {}]]]}, {"name": "move", "class_name": "Model", "config": {"name": "move", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["xvb", 0, 0, {}]]]}, {"name": "reshape_8", "class_name": "Reshape", "config": {"name": "reshape_8", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["v", 0, 0, {}]]]}, {"name": "bounce_concat", "class_name": "Concatenate", "config": {"name": "bounce_concat", "trainable": true, "axis": -1}, "inbound_nodes": [[["bounce", 1, 0, {}], ["reshape_7", 0, 0, {}]]]}, {"name": "move_concat", "class_name": "Concatenate", "config": {"name": "move_concat", "trainable": true, "axis": -1}, "inbound_nodes": [[["move", 1, 0, {}], ["reshape_8", 0, 0, {}]]]}, {"name": "1-att", "class_name": "Lambda", "config": {"name": "1-att", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAABkAXwAGABTACkCTukBAAAAqQApAdoBc3ICAAAAcgIA\nAAD6HzxpcHl0aG9uLWlucHV0LTI4LWZjZmQwMDkzNDBmNj7aCDxsYW1iZGE+GgAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["attention", 1, 0, {}]]]}, {"name": "mul_att_bounce", "class_name": "Multiply", "config": {"name": "mul_att_bounce", "trainable": true}, "inbound_nodes": [[["bounce_concat", 0, 0, {}], ["attention", 1, 0, {}]]]}, {"name": "mul_att_move", "class_name": "Multiply", "config": {"name": "mul_att_move", "trainable": true}, "inbound_nodes": [[["move_concat", 0, 0, {}], ["1-att", 0, 0, {}]]]}, {"name": "output", "class_name": "Add", "config": {"name": "output", "trainable": true}, "inbound_nodes": [[["mul_att_bounce", 0, 0, {}], ["mul_att_move", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["output", 0, 0]]}, "inbound_nodes": [[["reshape_9", 0, 0, {}]], [["reshape_10", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["module", 1, 0, {}], ["module", 2, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["concatenate_2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}