{"class_name": "Model", "config": {"name": "model_19", "layers": [{"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "lambda_152", "class_name": "Lambda", "config": {"name": "lambda_152", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQAZAGFAmYCGQBTACkCTukEAAAAqQAp\nAdoBc3ICAAAAcgIAAAD6IDxpcHl0aG9uLWlucHV0LTEwNy05YTU2Mzk5YTQzMGE+2gg8bGFtYmRh\nPgMAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [4], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "lambda_153", "class_name": "Lambda", "config": {"name": "lambda_153", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQBZACFAmYCGQBTACkCTukEAAAAqQAp\nAdoBc3ICAAAAcgIAAAD6IDxpcHl0aG9uLWlucHV0LTEwNy05YTU2Mzk5YTQzMGE+2gg8bGFtYmRh\nPgcAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [4, 1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "reshape_40", "class_name": "Reshape", "config": {"name": "reshape_40", "trainable": true, "target_shape": [4]}, "inbound_nodes": [[["lambda_152", 0, 0, {}]]]}, {"name": "reshape_41", "class_name": "Reshape", "config": {"name": "reshape_41", "trainable": true, "target_shape": [4]}, "inbound_nodes": [[["lambda_153", 0, 0, {}]]]}, {"name": "model_15", "class_name": "Model", "config": {"name": "model_15", "layers": [{"name": "input_20", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_20"}, "inbound_nodes": []}, {"name": "lambda_137", "class_name": "Lambda", "config": {"name": "lambda_137", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtOTktZDUxMzIwM2FkYTFmPtoIPGxhbWJkYT4DAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "lambda_139", "class_name": "Lambda", "config": {"name": "lambda_139", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QIAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtOTktZDUxMzIwM2FkYTFmPtoIPGxhbWJkYT4FAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "lambda_140", "class_name": "Lambda", "config": {"name": "lambda_140", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QMAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtOTktZDUxMzIwM2FkYTFmPtoIPGxhbWJkYT4GAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "lambda_141", "class_name": "Lambda", "config": {"name": "lambda_141", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcyAAAAB0AGoBfABkARkAfABkAhkAfABkAxkAZwNkAmQEjQJT\nACkFTukAAAAA6QEAAADpAgAAACkB2gRheGlzKQLaAUvaBXN0YWNrKQHaAXOpAHIIAAAA+h88aXB5\ndGhvbi1pbnB1dC05OS1kNTEzMjAzYWRhMWY+2gg8bGFtYmRhPgcAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": [3], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_139", 0, 0, {}], ["lambda_140", 0, 0, {}], ["lambda_137", 0, 0, {}]]]}, {"name": "lambda_138", "class_name": "Lambda", "config": {"name": "lambda_138", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QEAAACpACkB2gFz\ncgIAAAByAgAAAPofPGlweXRob24taW5wdXQtOTktZDUxMzIwM2FkYTFmPtoIPGxhbWJkYT4EAAAA\ncwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_20", 0, 0, {}]]]}, {"name": "model_16", "class_name": "Model", "config": {"name": "model_16", "layers": [{"name": "input_16", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_16"}, "inbound_nodes": []}, {"name": "model_15", "class_name": "Model", "config": {"name": "model_15", "layers": [{"name": "input_15", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_15"}, "inbound_nodes": []}, {"name": "dense_14", "class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "units": 2, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_15", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_14", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB0AGoBZAF8ABgAfABnAoMBUwApAk7pAQAAACkC2gFL\n2gtjb25jYXRlbmF0ZSkB2gFzqQByBQAAAPofPGlweXRob24taW5wdXQtODAtZmM0YzkxYzRlZjJj\nPtoIPGxhbWJkYT4EAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}], "input_layers": [["input_15", 0, 0]], "output_layers": [["lambda_18", 0, 0]]}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "lambda_19", "class_name": "Lambda", "config": {"name": "lambda_19", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxQAAAB8AGQAZACFAmQAZAGFAmYCGQBTACkCTukCAAAAqQAp\nAdoBc3ICAAAAcgIAAAD6HzxpcHl0aG9uLWlucHV0LTg3LTI1NDJlYWUzNWFlMj7aCDxsYW1iZGE+\nBAAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_16", 0, 0, {}]]]}, {"name": "multiply_11", "class_name": "Multiply", "config": {"name": "multiply_11", "trainable": true}, "inbound_nodes": [[["model_15", 1, 0, {}], ["lambda_19", 0, 0, {}]]]}, {"name": "lambda_20", "class_name": "Lambda", "config": {"name": "lambda_20", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPofPGlweXRob24taW5wdXQtODctMjU0MmVh\nZTM1YWUyPtoIPGxhbWJkYT4HAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_11", 0, 0, {}]]]}], "input_layers": [["input_16", 0, 0]], "output_layers": [["lambda_20", 0, 0]]}, "inbound_nodes": [[["lambda_141", 0, 0, {}]]]}, {"name": "lambda_142", "class_name": "Lambda", "config": {"name": "lambda_142", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxoAAAB0AGoBfABkARkAfABkAhkAZwJkAmQDjQJTACkETukA\nAAAA6QEAAAApAdoEYXhpcykC2gFL2gVzdGFjaykB2gFzqQByBwAAAPofPGlweXRob24taW5wdXQt\nOTktZDUxMzIwM2FkYTFmPtoIPGxhbWJkYT4NAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_137", 0, 0, {}], ["lambda_138", 0, 0, {}]]]}, {"name": "reshape_30", "class_name": "Reshape", "config": {"name": "reshape_30", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["model_16", 1, 0, {}]]]}, {"name": "concatenate_30", "class_name": "Concatenate", "config": {"name": "concatenate_30", "trainable": true, "axis": -1}, "inbound_nodes": [[["lambda_142", 0, 0, {}], ["reshape_30", 0, 0, {}]]]}, {"name": "lambda_143", "class_name": "Lambda", "config": {"name": "lambda_143", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAEAAABDAAAAcwYAAAB8AAsAUwApAU6pACkB2gFzcgEAAAByAQAAAPofPGlw\neXRob24taW5wdXQtOTktZDUxMzIwM2FkYTFmPtoIPGxhbWJkYT4TAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_138", 0, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"name": "reshape_31", "class_name": "Reshape", "config": {"name": "reshape_31", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_143", 0, 0, {}]]]}, {"name": "model_32", "class_name": "Model", "config": {"name": "model_32", "layers": [{"name": "input_49", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_49"}, "inbound_nodes": []}, {"name": "dense_92", "class_name": "Dense", "config": {"name": "dense_92", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "dense_93", "class_name": "Dense", "config": {"name": "dense_93", "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_49", 0, 0, {}]]]}, {"name": "lambda_63", "class_name": "Lambda", "config": {"name": "lambda_63", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB8AGQAZACFAmQBZgIZAGcBUwApAk7pAAAAAKkAKQHa\nAXNyAgAAAHICAAAA+iA8aXB5dGhvbi1pbnB1dC0xMjAtMDg2MzMxMzAwYjJmPtoIPGxhbWJkYT4E\nAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_92", 0, 0, {}]]]}, {"name": "lambda_65", "class_name": "Lambda", "config": {"name": "lambda_65", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxIAAAB8AGQAZACFAmQBZgIZAGcBUwApAk7pAAAAAKkAKQHa\nAXNyAgAAAHICAAAA+iA8aXB5dGhvbi1pbnB1dC0xMjAtMDg2MzMxMzAwYjJmPtoIPGxhbWJkYT4M\nAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["dense_93", 0, 0, {}]]]}, {"name": "reshape_40", "class_name": "Reshape", "config": {"name": "reshape_40", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_63", 0, 0, {}]]]}, {"name": "reshape_42", "class_name": "Reshape", "config": {"name": "reshape_42", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_65", 0, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["reshape_40", 0, 0, {}]], [["reshape_42", 0, 0, {}]]]}, {"name": "multiply_25", "class_name": "Multiply", "config": {"name": "multiply_25", "trainable": true}, "inbound_nodes": [[["dense_92", 0, 0, {}], ["model_1", 1, 0, {}]]]}, {"name": "multiply_26", "class_name": "Multiply", "config": {"name": "multiply_26", "trainable": true}, "inbound_nodes": [[["dense_93", 0, 0, {}], ["model_1", 2, 0, {}]]]}, {"name": "lambda_64", "class_name": "Lambda", "config": {"name": "lambda_64", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPogPGlweXRob24taW5wdXQtMTIwLTA4NjMz\nMTMwMGIyZj7aCDxsYW1iZGE+CAAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_25", 0, 0, {}]]]}, {"name": "lambda_66", "class_name": "Lambda", "config": {"name": "lambda_66", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcyAAAAB8AGQAZACFAmQBZgIZAHwAZABkAIUCZAJmAhkAFwBT\nACkDTukAAAAA6QEAAACpACkB2gFzcgMAAAByAwAAAPogPGlweXRob24taW5wdXQtMTIwLTA4NjMz\nMTMwMGIyZj7aCDxsYW1iZGE+EAAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["multiply_26", 0, 0, {}]]]}, {"name": "reshape_41", "class_name": "Reshape", "config": {"name": "reshape_41", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_64", 0, 0, {}]]]}, {"name": "reshape_43", "class_name": "Reshape", "config": {"name": "reshape_43", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_66", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": 1}, "inbound_nodes": [[["reshape_41", 0, 0, {}], ["reshape_43", 0, 0, {}]]]}, {"name": "dense_94", "class_name": "Dense", "config": {"name": "dense_94", "trainable": true, "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "dense_95", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "units": 1, "activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_94", 0, 0, {}]]]}], "input_layers": [["input_49", 0, 0]], "output_layers": [["dense_95", 0, 0]]}, "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"name": "model_2", "class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "inbound_nodes": [[["concatenate_30", 0, 0, {}]]]}, {"name": "reshape_32", "class_name": "Reshape", "config": {"name": "reshape_32", "trainable": true, "target_shape": [1]}, "inbound_nodes": [[["lambda_138", 0, 0, {}]]]}, {"name": "concatenate_31", "class_name": "Concatenate", "config": {"name": "concatenate_31", "trainable": true, "axis": -1}, "inbound_nodes": [[["model_1", 1, 0, {}], ["reshape_31", 0, 0, {}]]]}, {"name": "concatenate_32", "class_name": "Concatenate", "config": {"name": "concatenate_32", "trainable": true, "axis": -1}, "inbound_nodes": [[["model_2", 1, 0, {}], ["reshape_32", 0, 0, {}]]]}, {"name": "lambda_144", "class_name": "Lambda", "config": {"name": "lambda_144", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwgAAABkAXwAGABTACkCTukBAAAAqQApAdoBc3ICAAAAcgIA\nAAD6HzxpcHl0aG9uLWlucHV0LTk5LWQ1MTMyMDNhZGExZj7aCDxsYW1iZGE+FwAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["model_32", 1, 0, {}]]]}, {"name": "multiply_15", "class_name": "Multiply", "config": {"name": "multiply_15", "trainable": true}, "inbound_nodes": [[["concatenate_31", 0, 0, {}], ["model_32", 1, 0, {}]]]}, {"name": "multiply_16", "class_name": "Multiply", "config": {"name": "multiply_16", "trainable": true}, "inbound_nodes": [[["concatenate_32", 0, 0, {}], ["lambda_144", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["multiply_15", 0, 0, {}], ["multiply_16", 0, 0, {}]]]}], "input_layers": [["input_20", 0, 0]], "output_layers": [["add_6", 0, 0]]}, "inbound_nodes": [[["reshape_40", 0, 0, {}]], [["reshape_41", 0, 0, {}]]]}, {"name": "concatenate_36", "class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "axis": -1}, "inbound_nodes": [[["model_15", 1, 0, {}], ["model_15", 2, 0, {}]]]}], "input_layers": [["input_25", 0, 0]], "output_layers": [["concatenate_36", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}